{
  "id": "nails_les4",
  "industryId": "nails",
  "order": 4,
  "title": "Shaping & Extensions",
  "description": "Tư vấn dáng móng và thực hiện kỹ thuật nối móng/đắp bột.",
  "situation": "Sau khi làm sạch da, Hân bắt đầu xử lý bề mặt móng để chuẩn bị gắn móng giả cho Ms. Minh.",
  "objective": "Thực hiện quy trình chuẩn bị bề mặt, tư vấn dáng móng phù hợp và kiểm tra độ cân đối.",
  "steps": [
    {
      "step": 1,
      "purpose": "Chuẩn bị bề mặt (Surface Prep)",
      "dialogue": {
        "output": {
          "primary": "Before we start, we need to buff the surface so that the gel stays longer.",
          "primary_vi": "Trước khi bắt đầu, em cần dũa nhám bề mặt để lớp gel bám bền hơn ạ.",
          "alternatives": [
            {
              "text": "I’m applying the primer now to dehydrate the nail.",
              "vi": "Em đang sơn lớp chống kiềm để làm khô bề mặt móng ạ."
            },
            {
              "text": "Please put on these gloves to protect your skin from the UV light.",
              "vi": "Chị vui lòng đeo găng tay này để bảo vệ da khỏi tia UV nhé."
            }
          ]
        },
        "input": "Okay, I'm ready. Just let me know what to do next.",
        "input_vi": "Được rồi, tôi sẵn sàng. Cứ bảo tôi cần làm gì tiếp theo nhé."
      }
    },
    {
      "step": 2,
      "purpose": "Tư vấn dáng móng (Nail Shape)",
      "dialogue": {
        "output": {
          "primary": "Which nail shape do you prefer: Almond, Square, or Coffin?",
          "primary_vi": "Chị thích dáng móng nào hơn: Hạnh nhân, Vuông hay Quan tài ạ?",
          "alternatives": [
            {
              "text": "I suggest Almond shape for a natural look. What do you think?",
              "vi": "Em đề xuất dáng hạnh nhân để nhìn tự nhiên. Chị thấy sao ạ?"
            },
            {
              "text": "Since you want something elegant, Coffin shape would be perfect.",
              "vi": "Vì chị muốn kiểu sang trọng, dáng quan tài sẽ rất hoàn hảo ạ."
            }
          ]
        },
        "input": "I'll go with Almond shape and Gel extensions, please.",
        "input_vi": "Cho chị dáng hạnh nhân và úp gel nhé."
      }
    },
    {
      "step": 3,
      "purpose": "Xác nhận độ dài (Length Check)",
      "dialogue": {
        "output": {
          "primary": "How does this length look to you? Should I cut it shorter?",
          "primary_vi": "Chị thấy độ dài này thế nào ạ? Em có nên cắt ngắn thêm không?",
          "alternatives": [
            {
              "text": "Is this length okay for you, or do you prefer it shorter?",
              "vi": "Độ dài này ổn với chị chưa, hay chị muốn ngắn hơn ạ?"
            },
            {
              "text": "Please check the length of both hands to make sure they match.",
              "vi": "Chị vui lòng kiểm tra độ dài cả hai tay để đảm bảo chúng đều nhau ạ."
            }
          ]
        },
        "input": "This length is perfect, don't cut it anymore.",
        "input_vi": "Độ dài này hoàn hảo rồi, đừng cắt thêm nữa."
      }
    },
    {
      "step": 4,
      "purpose": "Kiểm tra độ thẳng & Cân đối",
      "dialogue": {
        "output": {
          "primary": "Let me check if the nail tips are straight and balanced on both hands.",
          "primary_vi": "Để em kiểm tra xem móng nối có thẳng và cân đối ở cả hai tay không nhé.",
          "alternatives": [
            {
              "text": "The nails look perfectly aligned now. Are you happy with the form?",
              "vi": "Móng nhìn đã hoàn toàn thẳng hàng rồi ạ. Chị có hài lòng với form móng không?"
            },
            {
              "text": "I will file the edges a bit more to make the shape perfect.",
              "vi": "Em sẽ dũa thêm các cạnh một chút để dáng móng hoàn hảo hơn."
            }
          ]
        }
      }
    }
  ],
  "vocabulary": [
    {"word": "Almond", "vi": "Dáng hạnh nhân", "category": "specialized"},
    {"word": "Coffin", "vi": "Dáng quan tài", "category": "specialized"},
    {"word": "Buff", "vi": "Dũa nhám bề mặt", "category": "specialized"},
    {"word": "Primer", "vi": "Sơn chống kiềm", "category": "specialized"},
    {"word": "Balanced", "vi": "Cân đối", "category": "general"}
  ],
  "grammar": {
    "structures": ["Purpose structure (so that)", "Choice questions (A, B or C?)"],
    "collocations": ["Put on gloves", "Natural look", "Straight and balanced"]
  }
}