{
  "id": "nails_les1",
  "industryId": "nails",
  "order": 1,
  "title": "Proactive Booking",
  "description": "Chủ động dẫn dắt cuộc gọi đặt lịch: Dịch vụ, Thời gian, Số lượng.",
  "situation": "Hân tiếp nhận cuộc gọi từ khách hàng Ms. Minh để đặt lịch hẹn dịch vụ tại Star Spa.",
  "objective": "Thu thập thông tin đặt lịch, kiểm tra khung giờ trống và chốt lịch hẹn chuyên nghiệp.",
  "steps": [
    {
      "step": 1,
      "purpose": "Chào hỏi điện thoại & Xác định mục đích",
      "dialogue": {
        "output": {
          "primary": "Star Spa, Hân speaking. How can I help you?",
          "primary_vi": "Star Spa, Hân đang nghe máy ạ. Em có thể giúp gì cho chị?",
          "alternatives": [
            {
              "text": "Hello, Star Spa. How may I assist you today?",
              "vi": "Xin chào, Star Spa xin nghe. Em có thể hỗ trợ gì cho chị hôm nay ạ?"
            },
            {
              "text": "Good morning, Star Spa. Are you looking to book an appointment?",
              "vi": "Chào buổi sáng, Star Spa xin nghe. Chị muốn đặt lịch hẹn phải không ạ?"
            }
          ]
        },
        "input": "Hi, I'd like to book an appointment for tomorrow.",
        "input_vi": "Chào em, chị muốn đặt lịch hẹn cho ngày mai."
      }
    },
    {
      "step": 2,
      "purpose": "Xác định dịch vụ & Số lượng khách",
      "dialogue": {
        "output": {
          "primary": "Is it for one person or two? And what services are you looking for?",
          "primary_vi": "Chị đặt cho một hay hai người ạ? Và chị đang quan tâm đến dịch vụ nào?",
          "alternatives": [
            {
              "text": "How many people are coming? Will you be doing both manicure and pedicure?",
              "vi": "Có bao nhiêu người sẽ đến ạ? Chị sẽ làm cả tay và chân luôn chứ?"
            },
            {
              "text": "Who is the appointment for? Do you have any specific service in mind?",
              "vi": "Chị đặt hẹn cho ai ạ? Chị đã có ý định làm dịch vụ cụ thể nào chưa?"
            }
          ]
        },
        "input": "Just for me. I want a full set of gel nails.",
        "input_vi": "Chỉ mình chị thôi. Chị muốn làm một bộ móng gel đầy đủ."
      }
    },
    {
      "step": 3,
      "purpose": "Kiểm tra khung giờ trống",
      "dialogue": {
        "output": {
          "primary": "What time would you like? We have a slot available at 3 PM.",
          "primary_vi": "Chị muốn mấy giờ ạ? Bên em còn trống chỗ lúc 3 giờ chiều.",
          "alternatives": [
            {
              "text": "When can you come? We are available in the afternoon after 2 PM.",
              "vi": "Khi nào chị có thể đến ạ? Bên em còn trống lịch vào buổi chiều sau 2 giờ."
            },
            {
              "text": "Does 10 AM work for you, or would you prefer later in the day?",
              "vi": "10 giờ sáng có tiện cho chị không, hay chị thích muộn hơn trong ngày ạ?"
            }
          ]
        },
        "input": "3 PM is perfect. Please note it down.",
        "input_vi": "3 giờ chiều thì tuyệt quá. Em ghi lại giúp chị nhé."
      }
    },
    {
      "step": 4,
      "purpose": "Xác nhận lại & Kết thúc cuộc gọi",
      "dialogue": {
        "output": {
          "primary": "Let me confirm: tomorrow at 3 PM for Ms. Minh. See you then!",
          "primary_vi": "Để em xác nhận lại: ngày mai lúc 3 giờ chiều cho chị Minh. Hẹn gặp lại chị!",
          "alternatives": [
            {
              "text": "Everything is set. We'll see you tomorrow at 3 PM. Have a nice day!",
              "vi": "Mọi thứ đã xong ạ. Hẹn gặp chị vào 3 giờ chiều mai. Chúc chị một ngày tốt lành!"
            },
            {
              "text": "I've booked your slot. Is there anything else I can help you with?",
              "vi": "Em đã đặt chỗ cho chị rồi ạ. Em còn có thể giúp gì thêm cho chị không?"
            }
          ]
        }
      }
    }
  ],
  "vocabulary": [
    {"word": "Speaking", "vi": "Đang nghe máy", "category": "general"},
    {"word": "Appointment", "vi": "Lịch hẹn", "category": "general"},
    {"word": "Available", "vi": "Còn trống/Sẵn sàng", "category": "general"},
    {"word": "Slot", "vi": "Khung giờ", "category": "general"},
    {"word": "Confirm", "vi": "Xác nhận", "category": "general"}
  ],
  "grammar": {
    "structures": ["WH-Questions for time", "Choice Questions"],
    "collocations": ["Book an appointment", "How can I help you?"]
  }
}